Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions Class
 The PourObjectFilterExpressions class contains all the pour object filter expressions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PourObjectFilterExpressions
Public NotInheritable Class PourObjectFilterExpressions
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace